In [1]:
import pandas as pd
import numpy as np

In [2]:
data = [1,2,3,4]
s = pd.Series(data)

In [3]:
print(s)

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
s=  pd.DataFrame(data)

In [6]:
print(s)

   0
0  1
1  2
2  3
3  4

In [7]:
s

   0
0  1
1  2
2  3
3  4

# DataFrame Example

In [8]:
data = {
    'year': [2016, 2017, 2018],
    'GDP rate' : [2.8, 3.2, 3.0],
    'GDP' : ['1.637M','1.73M','1.83M']
}

In [9]:
df = pd.DataFrame(data)

In [10]:
df

   year  GDP rate     GDP
0  2016       2.8  1.637M
1  2017       3.2   1.73M
2  2018       3.0   1.83M

# Panel Example

In [14]:
data = np.random.rand(2,3,4)
p = pd.panel(data)
print(p)

AttributeError: module 'pandas' has no attribute 'panel'

In [15]:
df['year']

0    2016
1    2017
2    2018
Name: year, dtype: int64

In [16]:
df.year

0    2016
1    2017
2    2018
Name: year, dtype: int64

In [24]:
df[df['year']==2017]

   year  GDP rate    GDP
1  2017       3.2  1.73M

In [25]:
df

   year  GDP rate     GDP
0  2016       2.8  1.637M
1  2017       3.2   1.73M
2  2018       3.0   1.83M

In [28]:
sum=df['GDP rate'].sum()
avg=df['GDP rate'].mean()

In [29]:
print(sum, avg)

9.0 3.0

In [36]:
s = pd.Series(np.random.random(5))

In [38]:
print(s)

0    0.596785
1    0.000086
2    0.424886
3    0.207815
4    0.025301
dtype: float64

In [40]:
s = pd.Series(np.random.randn(5), index=['A','B','C','D','E'])

In [42]:
s

A    1.037958
B    1.471059
C   -0.709077
D    0.054720
E    0.783592
dtype: float64

In [43]:
d = {
    'a':0,
    'b':1,
    'c':2
}

In [44]:
df = pd.Series(d)

In [45]:
df

a    0
b    1
c    2
dtype: int64

In [46]:
df = pd.Series(d, index=['A','B','C'])

In [47]:
df

A   NaN
B   NaN
C   NaN
dtype: float64

In [48]:
print(df)

A   NaN
B   NaN
C   NaN
dtype: float64

In [49]:
data2 = [
    {'name' : 'Mark'},
    {'name' : 'ERIC'},
    {'name' : 'JENNIFER'}
]

df = pd.DataFrame(data2)

In [50]:
df

       name
0      Mark
1      ERIC
2  JENNIFER

In [51]:
df['add'] = [10,11,12]

In [52]:
df

       name  add
0      Mark   10
1      ERIC   11
2  JENNIFER   12